docs/posts/2016-09-22-the-ballad-of-mitch-randall.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 18, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>The Ballad of Mitch Randall</title>
<meta name="author" content="Randall Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/neat.css' type='text/css'/>
<link rel='stylesheet' href='/css/custom.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">The Ballad of Mitch Randall</h1>
<p class="subtitle" role="doc-subtitle">Sep 22, 2016</p>
</header><p>
(Sung to the tune of &ldquo;John Henry&rdquo;)
</p>

<p>
When Mitch Randall was a little baby,<br>
sitting on his father&rsquo;s knee.<br>
He tied a ribbon on his finger,<br>
and he held it in the air.<br>
Said, this bow tie&rsquo;s gonna be the death of me, Lord, Lord<br>
This bow tie&rsquo;s gonna be the death of me.
</p>

<p>
When Mitch Randall was just a little boy,<br>
his parents noticed that he was an unusual child.<br>
When other kids would want cookies and milk,<br>
all Mitch wanted was a piece of silk.
</p>

<p>
He&rsquo;d tie that silk to anything he could reach,<br>
the table leg,<br>
the chair leg,<br>
the dog&rsquo;s leg,<br>
his father&rsquo;s leg.
</p>

<p>
Nice neat bows,<br>
straight,<br>
even on both sides.
</p>

<p>
And then one day,
<br>
He was standing in front of the mirror,<br>
seeing what he could see.<br>
He tied that piece of ribbon right around his neck, and said,<br>
this is the look for me, Lord, Lord.<br>
This is the look for me.
<br>
So, he started wearing a bow tie to church.<br>
Everybody thought it was cute.<br>
Then he wore it to school.<br>
That was not so cute.<br>
When he started wearing it with his baseball uniform,<br>
everybody thought it was just a little weird.
</p>


<p>
When the other kids started to tease him<br>
His dad decided to have a talk.<br>
He said, son,<br>
that may be the look down in Texas, Austin, that is,<br>
but this is Oklahoma, 1975.<br>
It&rsquo;s just not that progressive a state.<br>
But here&rsquo;s what I want you to remember:
<br>
Don&rsquo;t let them make fun of your bow tie,<br>
You gotta be who you gotta be.<br>
So, when you wear a bow tie round your neck,<br>
You gotta wear it with your head held high, Lord, Lord.<br>
Wear it with your head held high.
<br>
Then he went off to college.<br>
As it was for many young people,<br>
college was a place for experimenting,<br>
pushing the envelope,<br>
things you wouldn&rsquo;t necessarily tell your parents about,<br>
getting wild&#x2026;
</p>

<p>
Striped bow ties,<br>
plaids,<br>
polka dots,<br>
paisleys,<br>
there were parts of town where you could slip a man five bucks<br>
and he&rsquo;d give you a floral pattern tie.
</p>

<p>
Seminary was tough, though,<br>
cause this was fort worth,<br>
where they wore their hair short,<br>
And their ties long.<br>
He felt alone,<br>
nobody understood.<br>
But then one day,<br>
in a course on religion and the state,<br>
he learned about the Baptist Joint Committee,<br>
with men like James Dunn and Brent Walker,<br>
who wore their bow ties in the service of the Lord.
</p>

<p>
And, hallelujah, Mitch had found his calling!
<br>
When he saw the men with the bow ties,<br>
He said, you know I got to go,<br>
Down to Washington DC, to fight for liberty,<br>
I gotta be on the BJC, Lord, Lord.<br>
I gotta be on the BJC.
<br>
Then he came to NorthHaven.<br>
Growing up had been tough in northeastern Oklahoma,<br>
but Norman was different.<br>
There were liberals,<br>
hippies,<br>
Democrats,<br>
people who wouldn&rsquo;t look twice at a man with a bow tie.
</p>

<p>
And the people of NorthHaven admired his skill.<br>
Even on both sides,<br>
nice dimple in the center.<br>
Straight, not crooked,<br>
good-looking ties.
</p>

<p>
Everything was good, until&#x2026;
<br>
In one day, walked Bryan Partridge,<br>
With a smile on his face.<br>
The bow tie that we saw, was completely without flaw.<br>
And the challenge had been thrown down, Lord, Lord.<br>
The challenge had been thrown down.
</p>

<p>
Yes, my friends, it was the beginning of the end.<br>
The old ways were dying,<br>
passing away before a new generation.<br>
The age of the clip-on had come.
</p>

<p>
And Mitch Randall said to Bryan Partridge,<br>
I don&rsquo;t care if my tie is a wreck.<br>
Before I put that clip-on on my shirt,<br>
I&rsquo;ll die with a bow tie round my neck, Lord, Lord.<br>
I&rsquo;ll die with a bow tie round my neck.
</p>

<p>
They decided to have a contest.<br>
Whoever could put on the most ties in an hour<br>
would be the NorthHaven champion.<br>
It was old-school vs. the young upstart.
</p>

<p>
And so, Mitch Randall, he started tying.<br>
His fingers went round and round.<br>
But he couldn&rsquo;t make it last,<br>
cause the clip-on was so fast.<br>
It left poor Mitch on the ground, Lord, Lord.<br>
It left poor Mitch on the ground.
</p>

<p>
He couldn&rsquo;t keep up the pace<br>
With those small, delicate ties.<br>
He needed something bigger, easier to grasp.<br>
So, he reached for the secret weapon,<br>
The Barnum and Bailey special.
</p>

<p>
But when he wrapped that clown tie around his neck,<br>
Disaster struck.
</p>

<p>
Then his tie got caught in the shredder,<br>
and it pulled his head straight down.<br>
And the next thing that we knew,<br>
it looked like he was through.<br>
We&rsquo;d have to plant poor Mitch in the ground, Lord, Lord.<br>
We&rsquo;d have to plant poor Mitch in the ground.
</p>

<p>
Nobody knew what to do.<br>
One person screamed.<br>
Another person laughed.<br>
(One of those was Cheryl, another was Kim. I&rsquo;ll let you decide which was which.)<br>
And then Sheri walked into the room.<br>
she muttered something about boys and their foolishness,<br>
and cut that bow tie clean in half with a pair of scissors.
</p>

<p>
Then Mitch Randall said to Bryan Partridge,<br>
Lord knows, I&rsquo;ve been a fool.<br>
Well, before I die with a bow tie round my neck,<br>
I&rsquo;m gonna get me clip-on too, Lord, Lord.<br>
I&rsquo;m gonna get me clip-on too.
</p>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 18, 2024. Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.6.15).
</div>
</footer>
</body>
</html>
